Autodesk.Revit.DB.TriangulationInterfaceForTriangulatedSolidOrShell.#ctor(Autodesk.Revit.DB.TriangulatedSolidOrShell)
Construct an interface object for a TriangulatedSolidOrShell.
externalTriangulatedSolidOrShell:
The TriangulatedSolidOrShell that the interface object represents.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.TriangulationInterfaceForTriangulatedSolidOrShell
This class is used to call FacetingUtils::convertTrianglesToQuads with a triangulation defined
by a TriangulatedSolidOrShell.
Remarks:
The vertex and triangle indices used by this class treat the triangulated solid or shell as if all
the vertices and triangles of the different shell components were collected into single sets of vertices
and triangles, respectively. For example, if a solid has two shell components and the first has ten vertices
while the second has five vertices, vertexIndex 6 refers to vertex[6] of the first shell component, and
vertexIndex 12 refers to vertex[2] of the second shell component. You can use the class
TriangulationInterfaceForTriangulatedShellComponent to get a faceting of an individual shell component.
Since:
2013